###############################################################
#  Generated by:      Cadence Innovus 21.18-s099_1
#  OS:                Linux x86_64(Host ID ecs02.poly.edu)
#  Generated on:      Wed Apr 22 22:01:44 2026
#  Design:            soc_top
#  Command:           saveDesign /home/fy2243/soc_design/pd/latchfix_20260422_r5_web_hold/postfill_web_hold_r5.enc
###############################################################
current_design soc_top
create_clock [get_ports {clk}]  -name clk -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_ports {clk}]
set_driving_cell -lib_cell BUFFD1BWP16P90LVT -rise -min [get_ports {clk}]
set_driving_cell -lib_cell BUFFD1BWP16P90LVT -fall -min [get_ports {clk}]
set_driving_cell -lib_cell BUFFD1BWP16P90LVT -rise -max [get_ports {clk}]
set_driving_cell -lib_cell BUFFD1BWP16P90LVT -fall -max [get_ports {clk}]
set_driving_cell -lib_cell BUFFD1BWP16P90LVT -rise -min [get_ports {rst_n}]
set_driving_cell -lib_cell BUFFD1BWP16P90LVT -fall -min [get_ports {rst_n}]
set_driving_cell -lib_cell BUFFD1BWP16P90LVT -rise -max [get_ports {rst_n}]
set_driving_cell -lib_cell BUFFD1BWP16P90LVT -fall -max [get_ports {rst_n}]
set_driving_cell -lib_cell BUFFD1BWP16P90LVT -rise -min [get_ports {uart_rx}]
set_driving_cell -lib_cell BUFFD1BWP16P90LVT -fall -min [get_ports {uart_rx}]
set_driving_cell -lib_cell BUFFD1BWP16P90LVT -rise -max [get_ports {uart_rx}]
set_driving_cell -lib_cell BUFFD1BWP16P90LVT -fall -max [get_ports {uart_rx}]
set_load -pin_load -max  0.01  [get_ports {uart_tx}]
set_load -pin_load -min  0.01  [get_ports {uart_tx}]
set_load -pin_load -max  0.01  [get_ports {trap}]
set_load -pin_load -min  0.01  [get_ports {trap}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {uart_rx}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {uart_tx}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {trap}]
